{"config": {"name": "sequential_1", "layers": [{"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "batch_input_shape": [null, 32, 32, 3], "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "conv2d_1", "strides": [1, 1], "filters": 32, "kernel_constraint": null, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_1", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "name": "conv2d_2", "strides": [1, 1], "activation": "linear", "filters": 32}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_2", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.1, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "name": "conv2d_3", "strides": [1, 1], "activation": "linear", "filters": 64}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_3", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "name": "conv2d_4", "strides": [1, 1], "activation": "linear", "filters": 64}, "class_name": "Conv2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_4", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "rate": 0.2, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "name": "conv2d_5", "strides": [1, 1], "activation": "linear", "filters": 128}, "class_name": "Conv2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_5", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "name": "conv2d_6", "strides": [1, 1], "activation": "linear", "filters": 128}, "class_name": "Conv2D"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_6", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "name": "conv2d_7", "strides": [1, 1], "activation": "linear", "filters": 64}, "class_name": "Conv2D"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_7", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "name": "conv2d_8", "strides": [1, 1], "activation": "linear", "filters": 64}, "class_name": "Conv2D"}, {"config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_8", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "name": "conv2d_9", "strides": [1, 1], "activation": "linear", "filters": 32}, "class_name": "Conv2D"}, {"config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_9", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "name": "conv2d_10", "strides": [1, 1], "activation": "linear", "filters": 32}, "class_name": "Conv2D"}, {"config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_10", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_5", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 100, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "softmax", "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}